int value = 999;
// аналогично класс MathF.
Math.Abs(value);  // выводит наибольшее значение
Math.Acos(value); // выводит угол, косинус которого равен этому числу
Math.Asin(value); // выводит угол, синус которого равен этому числу
Math.Cbrt(value); // кубический корень
Math.Ceiling(value); //наименьшее значение
Math.Clamp(value, min, max); // возврщает число из диапазона min-max, либо max или min, если value выпадает из диапазона
Math.Cos(value); // выводит косинус указанного угла
Math.Sin(value); // выводит синус указанного угла
Math.Exp(value); // возвращает е, возведенное в указанную степень
Math.Floor(value); // Возвращает наибольшее целое число, которое меньше или равно заданному числу с плавающей запятой двойной точности
Math.Log2(value);// Возвращает целочисленный логарифм с основанием 2 указанного числа.
Math.Log(value);//Возвращает натуральный логарифм (с основанием e) указанного числа.
Mat.Log(value, value);//Возвращает логарифм указанного числа в системе счисления с указанным основанием.
Math.Log10(value);//Возвращает логарифм с основанием 10 указанного числа.

Math.Max(value, value); //Возвращает большее из двух десятичных чисел.
Math.Min(value, value); //Возвращает меньшее из двух десятичных чисел.
Math.Pow(value, value); //Возвращает указанное число, возведенное в указанную степень.
Math.Round(value, int32);//Округляет десятичное значение до указанного числа знаков после запятой; значения посередине округляются до ближайшего четного числа.
Math.Sqrt(value);//Возвращает квадратный корень из указанного числа.

public const double E = 2.7182818284590451;
Math.E; //Представляет основание натурального логарифма, определяемое константой e.
public const double PI = 3.1415926535897931;
Math.PI; //Представляет отношение длины окружности к ее диаметру, определяемое константой π.
